export const categories = [
    {
        id: "abaa154a-92b4-456e-9114-3c1b26a8ee82",
        name: "Художественная литература",
        books: [
            {   
                id: "de8d540c-b509-4975-b559-68868e58fdbb",
                name: "1984",
                author:
                {
                    id: "8afac424-12f0-45b4-8da0-304c1012d928",
                    name: "Оруэлл Джордж",
                },
                category: "Антиутопия",
                rating: 4,
                price: 310,
                annotation: "В «1984» продолжены основные мотивы «Скотного двора» — преданная революция, опасность ограничения личных свобод, авторитарная бонапартистская диктатура, эксплуатирующая попранные ею же достижения революции, — а также вводится образ, соответствующий Льву Троцкому (Снежок в «Скотном дворе», Голдстейн в «1984»).",
                reviews: [
                    {
                        id: "ba065470-8724-4607-b1f9-712072bf13eb",
                        author: {
                            id: "63d57554-d39d-45b7-828f-ffd292b29c39",
                            name: "София",
                        },
                        text: "Моя первая книга в жанре антиутопия. Прочитала на одном дыхании, хоть и читала около недели, мыслей во время прочтения было достаточно..Мурашки от строя в Океании, строй где личностей не должно быть, надо ‘распылять’ тех, кто хоть на малость задумывается. Обязательно попробуйте взять себе на прочтение!",
                        rating: 5,
                    },
                    {
                        id: "81b55747-5bd6-4176-8df3-be032478c308",
                        author: {
                            id: "e16c2df1-c57f-44b0-b6a8-27bc77259e13",
                            name: "Эмни",
                        },
                        text: "Купила книгу из за рекомендации учителя моей школы. Это произведение явно не из списка школьной литературы. Но тем не менее оно очень подходит под урок \"обществознание\". А конкретнее, в ней описан политический строй. Тоталитаризм - одна из самых ужасных и интересных форм правления. На мой взгляд в произведении он замечательно прописан. \"Что может быть хуже тотальной несвободы?\" - гласит описание книги. И я полностью согласна с автором. Сюжет хоть и не имеет особых ярких событий. Но мне кажется они были бы не к месту. История описывается тянуче и мрачно, от этого бывает тяжело читать. Но в конце книги понимаешь \"да, так писать и надо было\". Не жалею потраченного времени. Читается тяжело.",
                        rating: 4,
                    },
                    {
                        id: "9b32fd35-40f4-4a29-a2be-804566a0f78e",
                        author: {
                            id: "0d644d16-4161-4f39-8f5b-9ca4a646e3aa",
                            name: "Legendary",
                        },
                        text: "Моя первая книга в жанре антиутопии и одна из любимых книг в целом. Жёсткое, мрачноватое и напряжённое произведение, всемирно известное. Некоторые сюжетные повороты можно предсказать, а другие сбивают с толку. И помни: Большой Брат следит за тобой.",
                        rating: 5,
                    },
                    {
                        id: "2e3ba2ef-9735-462e-bfaa-36fa7b04b705",
                        author: {
                            id: "48fa0846-c856-431b-a604-56a49f3958f8",
                            name: "Славик",
                        },
                        text: "Основоположник, предводитель и император мировой антиутопии. От чтения 1984 Оруэлла невозможно оторваться, какими бы ни были ваши планы на дальнейший день, а после прочтения все больше хочется перечитать это произведение искусства снова. Не имеющая срока годности классика, за которую не стыдно. Колоритные персонажи, интереснейший сюжет. Советую всем без исключения: от любителей классики до любителей романов и пьес, здесь каждый найдёт то, что ему по душе.",
                        rating: 5,
                    },
                ]
            },
            {   
                id: "eb12d9ae-8cae-4c38-8de3-819673a7f164",
                name: "Преступление и наказание",
                author:
                {
                    id: "e353ac19-077e-4733-a649-9d9969a7053f",
                    name: "Федор Достоевский",
                },
                category: "Социально-психологический роман",
                rating: 5,
                price: 284,
            },
            {   
                id: "d4ddfed6-45ba-4c7a-9bbe-986d710d7057",
                name: "Горе от ума",
                author:
                {
                    id: "cdedf992-29d3-4ce4-b019-f80c9b3e18e6",
                    name: "Александр Грибоедов",
                },
                category: "Социально-психологический роман",
                rating: 5,
                price: 193,
            },
            {   
                id: "50efc71f-5007-4ffb-a6f6-54485653d9f3",
                name: "Портрет Дориана Грея",
                author:
                {
                    id: "9b4c1390-a222-40ab-9bd5-60764527caf2",
                    name: "Оскар Уайльд",
                },
                category: "Филосовский роман",
                rating: 5,
                price: 228,
            },
        ],
    },
    {
        id: "b9ed07ed-054d-427e-af6d-543738f8e7c5",
        name: "Нехудожественная литература",
        books: [
            {   
                id: "221e3e7b-b367-4054-9e21-50f36090a919",
                name: "Стратегия Го. Древняя игра и современный бизнес, или Как победить в конкурентной борьбе",
                author:
                {
                    id: "540a4a40-e40d-438c-a1d1-713fc5879aeb",
                    name: "Павел Авраамов",
                },
                category: "Саморазвитие",
                rating: 5,
                price: 2005,
            },
            {   
                id: "7b38562c-4c79-4a06-a85e-5256e5235bc3",
                name: "История России (с иллюстрациями). Учебник",
                author:
                {
                    id: "4cd4bcd6-dd8b-483b-b027-595c9f74fb8a",
                    name: "Орлов, Георгиев, Георгиева",
                },
                category: "Учебник",
                rating: 5,
                price: 774,
            },
            {   
                id: "5595911f-d82b-459e-a600-10708bfc1652",
                name: "Лучшие картины",
                author:
                {
                    id: "58444962-151c-4ed1-b3ba-deca72c34cba",
                    name: "Федор Васильев",
                },
                category: "Живопись",
                rating: 0,
                price: 683,
            },
        ],
    },
    {
        id: "5cf71b05-4cee-4981-a111-9190e13292a7",
        name: "Книги для детей",
        books: [
            {   
                id: "5ba8eec3-fc9d-45d0-926b-1a07c6d81d64",
                name: "Зов предков",
                author:
                {
                    id: "8ad0661d-b8d1-483c-8bb3-fcbcb3fe5ea1",
                    name: "Джек Лондон",
                },
                category: "Приключения",
                rating: 0,
                price: 354,
            },
            {   
                id: "fdcda899-f33b-4d49-afa2-4779c7e9dc7c",
                name: "Приключения Оливера Твиста",
                author:
                {
                    id: "889c10d2-b500-44fa-95d0-90a6ea18291a",
                    name: "Чарльз Диккенс",
                },
                category: "Приключения",
                rating: 5,
                price: 1001,
            },
            {   
                id: "57b0d31b-82d4-4261-8b42-6c16cebc7afc",
                name: "Дядя Фёдор и лето в Простоквашино",
                author:
                {
                    id: "eda51859-e143-4b48-b643-37207b0c2457",
                    name: "Эдуард Успенский",
                },
                category: "Сказка",
                rating: 4,
                price: 238,
            },
        ],
    },
    {
        id: "ce5f0e38-8c0f-4ac0-9648-b1e674065c74",
        name: "Переодические издания",
        books: [
            {   
                id: "20cb19de-e2bd-476d-aef1-bbd5a555bd1d",
                name: "Журнал Lego Ninjago",
                author:
                {
                    id: "ab191cc8-78cf-46a7-ae12-9ef0ed87feed",
                    name: "Lego",
                },
                category: "Журнал",
                rating: 5,
                price: 350,
            },
            {   
                id: "4dc21fa1-fec1-4d6b-a3f2-972503d1a0fb",
                name: "Журнал Непоседа",
                author:
                {
                    id: "d6d1838f-4987-4324-9d5a-c0831ecb15bf",
                    name: "Юнилайн",
                },
                category: "Журнал",
                rating: 4,
                price: 55,
            },
            {   
                id: "a017f824-7714-431f-9728-28edf7fb9ffc",
                name: "Журнал Forbes",
                author:
                {
                    id: "2503c86f-169c-416c-ac87-e881b14acdd0",
                    name: "Forbes",
                },
                category: "Журнал",
                rating: 5,
                price: 250,
            },
        ],
    },
    {
        id: "3c324b24-6c38-4d78-9ce1-def61ca0ef34",
        name: "Религия",
        books: [
            {   
                id: "4865ad28-c951-4f1f-a2f1-6c737f9461a2",
                name: "Будда, мозг и нейрофизиология счастья. Как изменить жизнь к лучшему",
                author:
                {
                    id: "cdce7d33-1a30-4697-824c-abbe447cd9dc",
                    name: "Йонге Ринпоче",
                },
                category: "Саморазвитие",
                rating: 5,
                price: 697,
            },
            {   
                id: "698dda3d-6584-4c5b-8573-0e167a12b0ef",
                name: "Евангельский синопсис",
                author:
                {
                    id: "090e94cc-3f8e-41dd-b6db-d99853a16c63",
                    name: "Библия",
                },
                category: "Религия",
                rating: 5,
                price: 713,
            },
            {   
                id: "d2c60f2e-31ae-4c23-b63a-e45019a76c58",
                name: "Восприятие Бога. Эпистемология религиозного опыта",
                author:
                {
                    id: "5271e9c0-7c0e-40a8-83a8-1099420a136b",
                    name: "Уильям Олстон",
                },
                category: "Религия",
                rating: 0,
                price: 977,
            },
        ],
    },
    {
        id: "f611d72a-4cb8-420e-8f95-06a03d519b1f",
        name: "Учебная литература",
        books: [
            {   
                id: "7b38562c-4c79-4a06-a85e-5256e5235bc3",
                name: "История России (с иллюстрациями). Учебник",
                author:
                {
                    id: "4cd4bcd6-dd8b-483b-b027-595c9f74fb8a",
                    name: "Орлов, Георгиев, Георгиева",
                },
                category: "Учебник",
                rating: 5,
                price: 774,
            },
            {   
                id: "2830fb63-41c4-4df1-9298-09c412853250",
                name: "Математика. Весь школьный курс в таблицах и схемах",
                author:
                {
                    id: "7790b537-5102-4764-b3dc-c3ad5c36b6a2",
                    name: "Мошкарева С.М.",
                },
                category: "Дополнительная литература",
                rating: 5,
                price: 199,
            },
            {   
                id: "f29b1147-2549-4882-a691-47ff9a9e99f7",
                name: "ЕГЭ-2023. Обществознание. 50 тренировочных вариантов",
                author:
                {
                    id: "58533827-d9ac-4d6a-9fc6-a17375064f85",
                    name: "Шевченко Сергей",
                },
                category: "Дополнительная литература",
                rating: 5,
                price: 525,
            },
        ],
    },
    {
        id: "eb492514-d084-4c56-b8ab-0de122afc13c",
        name: "Комиксы",
        books: [
            {   
                id: "373dc5e5-7f18-4e31-aa3d-940d0d7fdab3",
                name: "Удивительный Человек-паук. Первое появление Карнажа",
                author:
                {
                    id: "61166ff0-8763-44a7-b1ee-3bd280c55600",
                    name: "Микелайни Дэвид",
                },
                category: "Комиксы MARVEL",
                rating: 5,
                price: 296,
            },
            {   
                id: "517f5c3b-77d9-4998-b133-0bb013e2a387",
                name: "Майор Гром Том 1 Чумной доктор (часть 1)",
                author:
                {
                    id: "fdf6008d-a2cc-4280-ae26-869d873e6192",
                    name: "Габрелянов Артем",
                },
                category: "Комиксы",
                rating: 5,
                price: 550,
            },
            {   
                id: "e219c2cc-eaab-44f8-a9dd-18b408ca8adb",
                name: "Призрачный гонщик Джейсона Аарона. Омнибус",
                author:
                {
                    id: "f2236f6a-e8e6-49e1-880d-2da7808f4c52",
                    name: "Джейсон Аарон",
                },
                category: "Комиксы MARVEL",
                rating: 5,
                price: 3670,
            },
        ],
    },

]